{"keras_version": "2.0.1", "config": {"name": "fcn-densenet", "output_layers": [["reshape_2", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "initial_conv2D", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "initial_conv2D", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 48, "kernel_constraint": null}}, {"inbound_nodes": [[["initial_conv2D", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_1", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null]}]]], "name": "merge_1", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_1", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_2", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null, null]}], ["conv2d_2", 0, 0, {"mask": [null, null, null]}]]], "name": "merge_2", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_2", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_2", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_3", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_2", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_3", 0, 0, {"mask": [null, null, null, null]}]]], "name": "merge_3", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_3", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_3", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_4", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_2", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_3", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_4", 0, 0, {"mask": [null, null, null, null, null]}]]], "name": "merge_4", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_4", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_4", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_5", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 112, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "average_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_6", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_6", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null]}]]], "name": "merge_5", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_5", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_5", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_7", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_7", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null, null]}], ["conv2d_7", 0, 0, {"mask": [null, null, null]}]]], "name": "merge_6", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_6", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_6", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_8", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_8", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_7", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_8", 0, 0, {"mask": [null, null, null, null]}]]], "name": "merge_7", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_7", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_7", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_9", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_9", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_7", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_8", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_9", 0, 0, {"mask": [null, null, null, null, null]}]]], "name": "merge_8", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_8", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_8", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_10", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_10", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 176, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "average_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_11", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_11", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null]}]]], "name": "merge_9", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_9", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_9", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_12", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_12", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null, null]}], ["conv2d_12", 0, 0, {"mask": [null, null, null]}]]], "name": "merge_10", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_10", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_10", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_13", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_13", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_12", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_13", 0, 0, {"mask": [null, null, null, null]}]]], "name": "merge_11", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_11", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_11", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_14", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_14", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_12", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_13", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_14", 0, 0, {"mask": [null, null, null, null, null]}]]], "name": "merge_12", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_12", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_12", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_15", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_15", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 240, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "average_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_16", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_16", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null]}]]], "name": "merge_13", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_13", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_13", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_17", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_17", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null, null]}], ["conv2d_17", 0, 0, {"mask": [null, null, null]}]]], "name": "merge_14", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_14", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_14", 0, 0, {}]]], "name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_18", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_18", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_17", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_18", 0, 0, {"mask": [null, null, null, null]}]]], "name": "merge_15", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_15", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_15", 0, 0, {}]]], "name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_19", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_19", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_17", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_18", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_19", 0, 0, {"mask": [null, null, null, null, null]}]]], "name": "merge_16", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_16", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_16", 0, 0, {}]]], "name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_20", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_20", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_20", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 304, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "average_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]], "name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_21", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_21", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_21", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_4", 0, 0, {"mask": [null, null]}], ["conv2d_21", 0, 0, {"mask": [null, null]}]]], "name": "merge_17", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_17", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_17", 0, 0, {}]]], "name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_22", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_22", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_22", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_4", 0, 0, {"mask": [null, null, null]}], ["conv2d_21", 0, 0, {"mask": [null, null, null]}], ["conv2d_22", 0, 0, {"mask": [null, null, null]}]]], "name": "merge_18", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_18", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_18", 0, 0, {}]]], "name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_constraint": null, "name": "batch_normalization_23", "gamma_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_23", "class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_23", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "activation": "linear", "filters": 16, "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_4", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_21", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_22", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_23", 0, 0, {"mask": [null, null, null, null]}]]], "name": "merge_19", "class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "merge_19", "dot_axes": -1, "output_mask": null, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_19", 0, 0, {}]]], "name": 