{"class_name": "Model", "backend": "tensorflow", "config": {"name": "fcn-densenet", "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "inbound_nodes": []}, {"name": "initial_conv2D", "class_name": "Conv2D", "config": {"name": "initial_conv2D", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 48, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["initial_conv2D", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null, null]}], ["conv2d_2", 0, 0, {"mask": [null, null, null]}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_2", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_3", 0, 0, {"mask": [null, null, null, null]}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"name": "merge_4", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_1", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_2", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_3", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_4", 0, 0, {"mask": [null, null, null, null, null]}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_4", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 112, "bias_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "merge_5", "class_name": "Merge", "config": {"name": "merge_5", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_5", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "merge_6", "class_name": "Merge", "config": {"name": "merge_6", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null, null]}], ["conv2d_7", 0, 0, {"mask": [null, null, null]}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_6", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "merge_7", "class_name": "Merge", "config": {"name": "merge_7", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_7", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_8", 0, 0, {"mask": [null, null, null, null]}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_7", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "merge_8", "class_name": "Merge", "config": {"name": "merge_8", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_6", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_7", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_8", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_9", 0, 0, {"mask": [null, null, null, null, null]}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_8", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 176, "bias_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "merge_9", "class_name": "Merge", "config": {"name": "merge_9", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_9", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "merge_10", "class_name": "Merge", "config": {"name": "merge_10", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null, null]}], ["conv2d_12", 0, 0, {"mask": [null, null, null]}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_10", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "merge_11", "class_name": "Merge", "config": {"name": "merge_11", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_12", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_13", 0, 0, {"mask": [null, null, null, null]}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_11", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "merge_12", "class_name": "Merge", "config": {"name": "merge_12", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_11", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_12", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_13", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_14", 0, 0, {"mask": [null, null, null, null, null]}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_12", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 240, "bias_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "merge_13", "class_name": "Merge", "config": {"name": "merge_13", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_13", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "merge_14", "class_name": "Merge", "config": {"name": "merge_14", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null, null]}], ["conv2d_17", 0, 0, {"mask": [null, null, null]}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_14", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "merge_15", "class_name": "Merge", "config": {"name": "merge_15", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_17", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_18", 0, 0, {"mask": [null, null, null, null]}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_15", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "merge_16", "class_name": "Merge", "config": {"name": "merge_16", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_16", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_17", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_18", 0, 0, {"mask": [null, null, null, null, null]}], ["conv2d_19", 0, 0, {"mask": [null, null, null, null, null]}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_16", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 304, "bias_regularizer": null, "kernel_size": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "merge_17", "class_name": "Merge", "config": {"name": "merge_17", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_4", 0, 0, {"mask": [null, null]}], ["conv2d_21", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_17", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "merge_18", "class_name": "Merge", "config": {"name": "merge_18", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_4", 0, 0, {"mask": [null, null, null]}], ["conv2d_21", 0, 0, {"mask": [null, null, null]}], ["conv2d_22", 0, 0, {"mask": [null, null, null]}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "epsilon": 0.001}, "inbound_nodes": [[["merge_18", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "activation": "linear", "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "merge_19", "class_name": "Merge", "config": {"name": "merge_19", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "mode": "concat", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw"}, "inbound_nodes": [[["average_pooling2d_4", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_21", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_22", 0, 0, {"mask": [null, null, null, null]}], ["conv2d_23", 0, 0, {"mask": [null, null, null, null]}]]]}, 